--[[ 
	托管机器人配置
	CAT_MAX_HP		= 1,		// 血量上限
	CAT_MAX_MP  	= 2,		// 怒气上限(预留)
	CAT_ATC  		= 3,		// 攻击
	CAT_DEF			= 4,		// 防御
	CAT_HIT  		= 5,		// 命中
	CAT_DUCK  		= 6,		// 闪避
	CAT_CRIT		= 7,		// 暴击
	CAT_RESIST		= 8,		// 抵抗
	CAT_BLOCK	  	= 9,		// 格挡
	CAT_AB_ATC	  	= 10,		// 绝对伤害
	CAT_AB_DEF	  	= 11,		// 绝对防御
	CAT_CritDam	  	= 12,		// 暴击伤害	
	
	玩家基本信息={ 名字，等级，vip，外型，武器，帮会id，战斗力，头像 }
--]]

local _TSS_Config = {
	[1001] = {
		manor = {	
			mLv = 1,			-- 庄园等级
			mExp = 0,			-- 庄园经验
			Degr = 100,			-- 通缉度
		},
		tsData = {
			{ '烧卷了',39,0,5342,5009,0,1500,0},		-- 玩家基本信息
			{3000,0,400,800,350,250,250,250,250}, 		-- 玩家二级属性
			{{0,1},{1,3}},								-- 技能ID/技能等级
		},
		petID = 1,				-- 宠物形象
		heros = {
			[1] = {1001,1},		-- 随从
			[2] = {1002,1},		-- 随从
			fight = 1,
		},
		zsDT = 					-- 庄园装饰
		{
			[1]  = 100,			-- 背景ID
		},
	},
	[2001] = {
		manor = {	
			mLv = 1,			-- 庄园等级
			mExp = 0,			-- 庄园经验
			Degr = 100,			-- 通缉度
		},
		tsData = {
			{ '▂安静煜祺',39,0,5342,5009,0,1500,0},		-- 玩家基本信息
			{3000,0,400,800,350,250,250,250,250}, 		-- 玩家二级属性
			{{0,1},{1,3}}	,								-- 技能ID/技能等级
		},
		petID = 1,				-- 宠物形象
		heros = {
			[1] = {1001,1},		-- 随从
			[2] = {1002,1},		-- 随从
			fight = 1,
		},
		zsDT = 					-- 庄园装饰
		{
			[1]  = 100,			-- 背景ID
		},
	},
	[2002] = {
		manor = {	
			mLv = 1,			-- 庄园等级
			mExp = 0,			-- 庄园经验
			Degr = 100,			-- 通缉度
		},
		tsData = {
			{ '晴天∴彬郁',39,0,5342,5046,0,1500,0},		-- 玩家基本信息
			{3000,0,400,800,350,250,250,250,250}, 		-- 玩家二级属性
			{{0,1},{1,3}},									-- 技能ID/技能等级
		},
		petID = 1,				-- 宠物形象
		heros = {
			[1] = {1001,1},		-- 随从
			[2] = {1002,1},		-- 随从
			fight = 1,
		},
		zsDT = 					-- 庄园装饰
		{
			[1]  = 100,			-- 背景ID
		},
	},
	[2003] = {
		manor = {			
			mLv = 1,			-- 庄园等级
			mExp = 0,			-- 庄园经验
			Degr = 100,			-- 通缉度
		},
		tsData = {
			{ '笑笑睿渊♀',39,0,5379,5083,0,1500,1},		-- 玩家基本信息
			{3000,0,400,800,350,250,250,250,250}, 		-- 玩家二级属性
			{{10,11},{1,3}},									-- 技能ID/技能等级
		},
		petID = 1,				-- 宠物形象
		heros = {
			[1] = {1001,1},		-- 随从
			[2] = {1002,1},		-- 随从
			fight = 1,
		},
		zsDT = 					-- 庄园装饰
		{
			[1]  = 100,			-- 背景ID
		},
	},
	[2004] = {
		manor = {			
			mLv = 1,			-- 庄园等级
			mExp = 0,			-- 庄园经验
			Degr = 100,			-- 通缉度
		},
		tsData = {
			{ '小小哲瀚∮',39,0,5379,5120,0,1500,1},		-- 玩家基本信息
			{3000,0,400,800,350,250,250,250,250}, 		-- 玩家二级属性
			{{10,11},{1,3}},										-- 技能ID/技能等级
		},
		petID = 1,				-- 宠物形象
		heros = {
			[1] = {1001,1},		-- 随从
			[2] = {1002,1},		-- 随从
			fight = 1,
		},
		zsDT = 					-- 庄园装饰
		{
			[1]  = 100,			-- 背景ID
		},
	},
	[2005] = {
		manor = {			
			mLv = 1,			-- 庄园等级
			mExp = 0,			-- 庄园经验
			Degr = 100,			-- 通缉度
		},
		tsData = {
			{ '瞿瞳Ч',39,0,5416,5157,0,1500,2},		-- 玩家基本信息
			{3000,0,400,800,350,250,250,250,250}, 		-- 玩家二级属性
			{{20,21},{1,3}},										-- 技能ID/技能等级
		},
		petID = 1,				-- 宠物形象
		heros = {
			[1] = {1001,1},		-- 随从
			[2] = {1002,1},		-- 随从
			fight = 1,
		},
		zsDT = 					-- 庄园装饰
		{
			[1]  = 100,			-- 背景ID
		},
	},
	[2006] = {
		manor = {			
			mLv = 1,			-- 庄园等级
			mExp = 0,			-- 庄园经验
			Degr = 100,			-- 通缉度
		},
		tsData = {
			{ '￡无聊鸿哲',39,0,5416,5194,0,1500,2},		-- 玩家基本信息
			{3000,0,400,800,350,250,250,250,250}, 		-- 玩家二级属性
			{{20,21},{1,3}},									-- 技能ID/技能等级
		},
		petID = 1,				-- 宠物形象
		heros = {
			[1] = {1001,1},		-- 随从
			[2] = {1002,1},		-- 随从
			fight = 1,
		},
		zsDT = 					-- 庄园装饰
		{
			[1]  = 100,			-- 背景ID
		},
	},
}

TSS_Config = _TSS_Config