--[[
file:	Ring_Conf.lua
desc:	ring task config.
author:	chal
update:	2011-12-03

notes:
	1、悬赏任务 主任务ID 5
]]--

TaskList[5] = {}

TaskList[5][1] = {
	AcceptNPC = 50,						-- 接受任务NPC
	SubmitNPC = 50,
	TaskName = "悬赏任务",		-- 任务名称	
	nocancel=1,							-- 不能取消
	TaskInfo = "完成悬赏任务，任务品质越高，奖励越丰厚。",		-- 任务介绍
	ClientAcceptEvent = {				-- 客户端接受任务事件	
	},
	
	ClientSumitEvent = {				-- 客户端提交任务事件
	},	
	ServerAcceptEvent = {				-- 服务端接受任务事件
	},
	ServerCompleteEvent = {				-- 服务端完成任务事件			
	},

	AcceptCondition = {			-- 服务端接受任务条件	
		level = 35 
	},
	CompleteCondition = {			-- 服务端完成任务条件
		
	},
	CompleteAwards = 					-- 完成任务奖励
	{
	},
	
    AutoFindWay = { true, SubmitNPC = true},
	QuickClear = 2,
}

-- 悬赏任务配置
RingTaskConfig = {
	UnlockLevel = 38,  --面板解锁等级
	[1] = {
		LevelNeed = {35,39},		-- 需要等级
		TaskTemplate = 1,			-- 任务完成条件模板			
		CompleteAwards = {			-- 奖励固定
			[2] = 20000, --经验
			[1] = 2000,  --铜钱
		},	
		ExtraAwards = {		-- 额外奖励 完成今日所有悬赏
		},
	},
	[2] = {
		LevelNeed = {40,44},		-- 需要等级
		TaskTemplate = 1,			-- 任务完成条件模板			
		CompleteAwards = {			-- 奖励固定
			[2] = 25000, --经验
			[1] = 2000,  --铜钱
		},	
		ExtraAwards = {		-- 额外奖励 完成今日所有悬赏
		},
	},
	[3] = {
		LevelNeed = {45,49},		-- 需要等级
		TaskTemplate = 2,			-- 任务完成条件模板			
		CompleteAwards = {			-- 奖励固定
			[2] = 30000, --经验
			[1] = 2000,  --铜钱
		},	
		ExtraAwards = {		-- 额外奖励 完成今日所有悬赏
		},
	},
	[4] = {
		LevelNeed = {50,54},		-- 需要等级
		TaskTemplate = 3,			-- 任务完成条件模板			
		CompleteAwards = {			-- 奖励固定
			[2] = 32000, --经验
			[1] = 2000,  --铜钱
		},	
		ExtraAwards = {		-- 额外奖励 完成今日所有悬赏
		},
	},
	[5] = {
		LevelNeed = {55,59},		-- 需要等级
		TaskTemplate = 4,			-- 任务完成条件模板			
		CompleteAwards = {			-- 奖励固定
			[2] = 35000, --经验
			[1] = 2000,  --铜钱
		},	
		ExtraAwards = {		-- 额外奖励 完成今日所有悬赏
		},
	},
	[6] = {
		LevelNeed = {60,64},		-- 需要等级
		TaskTemplate = 5,			-- 任务完成条件模板			
		CompleteAwards = {			-- 奖励固定
			[2] = 40000, --经验
			[1] = 2000,  --铜钱
		},	
		ExtraAwards = {		-- 额外奖励 完成今日所有悬赏
		},
	},
	[7] = {
		LevelNeed = {65,69},		-- 需要等级
		TaskTemplate = 6,			-- 任务完成条件模板			
		CompleteAwards = {			-- 奖励固定
			[2] = 45000, --经验
			[1] = 2000,  --铜钱
		},	
		ExtraAwards = {		-- 额外奖励 完成今日所有悬赏
		},
	},
	[8] = {
		LevelNeed = {70,74},		-- 需要等级
		TaskTemplate = 7,			-- 任务完成条件模板			
		CompleteAwards = {			-- 奖励固定
			[2] = 60000, --经验
			[1] = 2000,  --铜钱
		},	
		ExtraAwards = {		-- 额外奖励 完成今日所有悬赏
		},
	},
	[9] = {
		LevelNeed = {75,100},		-- 需要等级
		TaskTemplate = 7,			-- 任务完成条件模板			
		CompleteAwards = {			-- 奖励固定
			[2] = 80000, --经验
			[1] = 2000,  --铜钱
		},	
		ExtraAwards = {		-- 额外奖励 完成今日所有悬赏
		},
	},
}


-- 悬赏任务库
RingTaskLib = {}

RingTaskLib[1] = {
	{ items = {{10001,1,{3,56,155,100002}}},},	
	{ items = {{10002,1,{1,71,155,100005}}},},	
	{ items = {{10003,1,{6,30,62,100010}}},},	
	{ items = {{10004,1,{8,41,89,100022}}},},	
	{ items = {{10005,1,{7,44,95,100026}}},},	
	{ items = {{10006,1,{8,71,130,100030}}},},	
	
	{ kill = { "M_017", 10 ,{8,15,51}},},
	{ kill = { "M_028", 10 ,{7,50,42}},},
	{ kill = { "M_012", 10 ,{6,10,30}},},
	{ kill = { "M_019", 10 ,{8,30,99},},},
}

RingTaskLib[2] = {
	{ items = {{10001,1,{3,56,155,100002}}},},	
	{ items = {{10002,1,{1,71,155,100005}}},},	
	{ items = {{10003,1,{6,30,62,100010}}},},	
	{ items = {{10004,1,{8,41,89,100022}}},},	
	{ items = {{10005,1,{7,44,95,100026}}},},	
	{ items = {{10006,1,{8,71,130,100030}}},},	
	
	{ kill = { "M_043", 20 ,{7,73,93}},},
	{ kill = { "M_044", 20 ,{7,71,122}},},
	{ kill = { "M_045", 20 ,{7,23,128}},},
	{ kill = { "M_046", 20 ,{7,4,98},},},
}
RingTaskLib[3] = {
	{ items = {{10001,1,{3,56,155,100002}}},},	
	{ items = {{10002,1,{1,71,155,100005}}},},	
	{ items = {{10003,1,{6,30,62,100010}}},},	
	{ items = {{10004,1,{8,41,89,100022}}},},	
	{ items = {{10005,1,{7,44,95,100026}}},},	
	{ items = {{10006,1,{8,71,130,100030}}},},	
	
	{ kill = { "M_065", 20 ,{10,12,83}},},
	{ kill = { "M_066", 20 ,{10,40,73}},},
	{ kill = { "M_067", 20 ,{10,59,28}},},
	{ kill = { "M_064", 20 ,{10,18,16}},},
}
RingTaskLib[4] = {
	{ items = {{10001,1,{3,56,155,100002}}},},	
	{ items = {{10002,1,{1,71,155,100005}}},},	
	{ items = {{10003,1,{6,30,62,100010}}},},	
	{ items = {{10004,1,{8,41,89,100022}}},},	
	{ items = {{10005,1,{7,44,95,100026}}},},	
	{ items = {{10006,1,{8,71,130,100030}}},},	
	
	{ kill = { "M_068", 20 ,{10,76,34}},},
	{ kill = { "M_069", 20 ,{10,39,37}},},

}
RingTaskLib[5] = {
	{ items = {{10001,1,{3,56,155,100002}}},},	
	{ items = {{10002,1,{1,71,155,100005}}},},	
	{ items = {{10003,1,{6,30,62,100010}}},},	
	{ items = {{10004,1,{8,41,89,100022}}},},	
	{ items = {{10005,1,{7,44,95,100026}}},},	
	{ items = {{10006,1,{8,71,130,100030}}},},	
	
	{ kill = { "M_070", 20 ,{10,49,22}},},
	{ kill = { "M_071", 20 ,{10,62,12}},},
	{ kill = { "M_072", 20 ,{10,45,104}},},
	{ kill = { "M_073", 20 ,{10,64,154}},},
}
RingTaskLib[6] = {
	{ items = {{10001,1,{3,56,155,100002}}},},	
	{ items = {{10002,1,{1,71,155,100005}}},},	
	{ items = {{10003,1,{6,30,62,100010}}},},	
	{ items = {{10004,1,{8,41,89,100022}}},},	
	{ items = {{10005,1,{7,44,95,100026}}},},	
	{ items = {{10006,1,{8,71,130,100030}}},},	
	
	{ kill = { "M_074", 20 ,{10,55,51}},},
	{ kill = { "M_075", 20 ,{10,111,125}},},
	{ kill = { "M_076", 20 ,{10,93,138}},},
	{ kill = { "M_077", 20 ,{10,115,164}},},
	{ kill = { "M_078", 20 ,{10,105,153}},},
}
--70级
RingTaskLib[7] = {	
	{ kill = { "M_127", 20 ,{12,26,220}},},
	{ kill = { "M_128", 20 ,{12,12,168}},},
	{ kill = { "M_129", 20 ,{12,26,124}},},
	{ kill = { "M_130", 20 ,{12,8,114}},},
	{ kill = { "M_132", 20 ,{12,85,218}},},
	{ kill = { "M_135", 20 ,{12,88,137}},},
}
