yuanshen_conf = 
{
--索引表示是魂魄的编号
--[1]是对应3条属性的类型
--[2]是获得奖励物品 [1] 是物品id,[2]是物品数量 [3]是否绑定 
--[3]是对应元神类型
--[4]描述 
--[5]boss形象
--cost_id 是消耗物品id
	[1] = {[1] = {4,10},[2] = {{812,30,1},},[3] = 1,[4] = '英魄幻影：七魄之一，拥有强大的攻击与防御能力，战斗力不足会陷入苦战！',[5] = 0,},
	[2] = {[1] = {1,11},[2] = {{812,31,1},},[3] = 1,[4] = '精魄幻影：七魄之一，擅长火属性攻击，必须要拥有一定的火系抗性，才有可能战胜！',[5] = 0,},
	[3] = {[1] = {4,12},[2] = {{812,32,1},},[3] = 1,[4] = '中枢幻影：七魄之一，擅长冰属性攻击，必须要拥有一定的冰系抗性，才有可能战胜！',[5] = 0,},
	[4] = {[1] = {3,2},[2] = {{812,33,1},},[3] = 2,[4] = '力魄幻影：七魄之一，擅长木属性攻击，必须要拥有一定的木系抗性，才有可能战胜！',[5] = 0,},
	[5] = {[1] = {2,10},[2] = {{812,34,1},},[3] = 2,[4] = '气魄幻影：七魄之一，防御极高，普通攻击对其基本无效，只有火冰木等属性攻击才能造出伤害！',[5] = 0,},
	[6] = {[1] = {2,11},[2] = {{812,35,1},},[3] = 2,[4] = '灵慧幻影：七魄之一，防御极高，普通攻击对其基本无效，只有火冰木等属性攻击才能造出伤害！',[5] = 0,},
	[7] = {[1] = {2,12},[2] = {{812,36,1},},[3] = 2,[4] = '天冲幻影：七魄之一，防御极高，普通攻击对其基本无效，只有火冰木等属性攻击才能造出伤害！',[5] = 0,},
	[8] = {[1] = {1,2,10},[2] = {{812,37,1},},[3] = 3,[4] = '命魂幻影：三魂之一，三个BOSS分别擅长三系攻击，且普通攻击无效。需要同时具备三系抗性，且拥有强大的属性攻击才能战胜！',[5] = 9903,},
	[9] = {[1] = {4,2,11},[2] = {{812,38,1},},[3] = 3,[4] = '地魂幻影：三魂之一，三个BOSS分别擅长三系攻击，且普通攻击无效。需要同时具备三系抗性，且拥有强大的属性攻击才能战胜！',[5] = 9901,},
	[10] = {[1] = {3,2,12},[2] = {{812,39,1},},[3] = 3,[4] = '天魂幻影：三魂之一，三个BOSS分别擅长三系攻击，且普通攻击无效。需要同时具备三系抗性，且拥有强大的属性攻击才能战胜！',[5] = 9902,},
	--按vip等级分类 玩家可购买的元神副本次数
	times = 
	{
		[0] = 1,
		[1] = 1,
		[2] = 1,
		[3] = 1,
		[4] = 2,
		[5] = 2,
		[6] = 3,
		[7] = 3,
		[8] = 3,
		[9] = 4,
		[10] = 4,
	},
	--消耗物品id
	cost_id = 812,
	ysmaxlv = 189, --三魂七魄 最大等级

}


