--[[
file:	WorldTransfer.lua
desc:	world transfer config.(only for client)
author:	chal
update:	2011-12-02
version:1.0.0
]]--

function wt_ver()
	return '1.0.0'
end

-- {mapID, x, y, speed, levelneed}
WorldTransfer = 
{
	--世界地图传送，等同于NPC传送，扣道具，VIP免费传送   有阵营的加 ,camp=1
	[1] = { itemid = 100 ,
		[1]={3,103,219,1}, --昆仑山
		[2]={1,75,69,10}, --西岐
		[3]={1,70,70,100,}, --牧野
		[4]={1,70,70,100}, --西岐城
		[5]={28,5,11,50}, --听风林
		[6]={24,54,41,40}, --金光洞
		[7]={7,88,21,20}, --乾元山
		[8]={1,26,104,70}, --绝龙岭
		[9]={8,50,8,20}, --陈塘关
		[10]={31,26,113,30}, --东海
		[11]={1,70,70,100}, --九重天
		[12]={1,70,70,100}, --渭水
	},
}