--[[
file:	Hero_base.lua
desc:	武将
author:	xiao.y
]]--
--武将配置 (1,2,3,4,5) 品质
--[[
  	CAT_MAX_HP	= 0,		// 血量上限 1
	CAT_MAX_MP,				// 职业攻击 2
	CAT_ATC,				// 攻击 3
	CAT_DEF,				// 防御 4
	CAT_HIT,				// 命中 5
	CAT_DUCK,				// 闪避 6
	CAT_CRIT,				// 暴击 7
	CAT_RESIST,				// 抵抗 8
	CAT_BLOCK,				// 格挡 9
	CAT_AB_ATC,				// 职业抗性1（火系抗性） 10
	CAT_AB_DEF,				// 职业抗性2（冰系抗性） 11
	CAT_CritDam,			// 职业抗性3（木系抗性）12
	CAT_MoveSpeed,			// 移动速度(预留) 13
	CAT_S_REDUCE,			// 抗性减免	      14
]]--
HeroInfoTb = {
	[1] = {
		[1] = {
			name = '彤云仙子',
			skill = {49,42},--name名字 skill主动技能(ID) power被动技能(ID) group成长值 point招募所需战魂点 sw招募所需达到声望 
			skilllevel = {1,1},
			group = {[1] = 18,[3] = 8,[4] = 6,[5] = 3,[6] = 1,[7] = 1,[8] = 1,[9] = 1,[13] = 322},
			point = 1000,
			rid = 2062,
		}, 
		[2] = {
			name = '黄天祥',
			skill = {34,37},
			skilllevel = {1,1},
			group = {[1] = 19,[3] = 9,[4] = 7,[5] = 4,[6] = 1,[7] = 1,[8] = 2,[9] = 1,[13] = 322},
			point = 5000,
			sw = 90,
			rid = 2135,
		},
	},
	[2] = {
		[1] = {
			name = '邓九公',
			skill = {34,43},
			skilllevel = {1,1},
			group = {[1] = 20,[3] = 10,[4] = 8,[5] = 5,[6] = 2,[7] = 2,[8] = 2,[9] = 1,[13] = 322},
			point = 20000,
			sw = 500,
			rid = 2137,
		}, 		 
		[2] = {
			name = '高兰英',
			skill = {53,44},
			skilllevel = {1,1},
			group = {[1] = 21,[3] = 10,[4] = 8,[5] = 6,[6] = 2,[7] = 3,[8] = 3,[9] = 2,[13] = 322},
			point = 50000,
			sw = 1500,
			rid = 2134,
		},
		[3] = { 
			name = '苏护',
			skill = {34,45},
			skilllevel = {1,1,1},
			group = {[1] = 22,[3] = 11,[4] = 9,[5] = 7,[6] = 3,[7] = 4,[8] = 3,[9] = 2,[13] = 322},
			point = 80000,
			sw = 3000,
			rid = 2054,	
		},
		[4] = { 
			name = '黄飞虎',
			skill = {34,167},
			skilllevel = {1,1,1},
			group = {[1] = 23,[3] = 11,[4] = 9,[5] = 8,[6] = 4,[7] = 4,[8] = 4,[9] = 3,[13] = 322},
			point = 120000,
			sw = 5000,
			rid = 2056,	
		},
		[5] = { 
			name = '金吒',
			skill = {34,168},
			skilllevel = {1,1,1},
			group = {[1] = 24,[3] = 12,[4] = 10,[5] = 9,[6] = 4,[7] = 4,[8] = 4,[9] = 3,[13] = 322},
			point = 150000,
			sw = 8000,
			rid = 2059,	
		},
		[6] = { 
			name = '李靖',
			skill = {52,41},
			skilllevel = {1,1,1},
			group = {[1] = 25,[3] = 12,[4] = 10,[5] = 10,[6] = 5,[7] = 5,[8] = 5,[9] = 4,[13] = 322},
			point = 200000,
			sw = 12000,
			rid = 2051,	
		},
	},
	[3] = {
		[1] = {
			name = '邓婵玉',
			skill = {51,36,169},
			skilllevel = {1,1,1},
			group = {[1] = 27,[3] = 13,[4] = 11,[5] = 11,[6] = 6,[7] = 6,[8] = 6,[9] = 5,[13] = 322},
			point = 300000,
			sw = 18000,
			rid = 2057,
		}, 	
		[2] = {
			name = '龙吉公主',
			skill = {52,172,174},
			skilllevel = {1,1,1},
			group = {[1] = 28,[3] = 13,[4] = 11,[5] = 12,[6] = 6,[7] = 7,[8] = 7,[9] = 6,[13] = 322},
			point = 450000,
			sw = 40000,
			rid = 2061,
		},	
		[3] = {
			name = '姜子牙',
			skill = {52,48,170},
			skilllevel = {1,1,1},
			group = {[1] = 29,[3] = 13,[4] = 11,[5] = 13,[6] = 7,[7] = 8,[8] = 7,[9] = 7,[13] = 322},
			point = 700000,
			sw = 80000,
			rid = 2053,
		}, 	
		[4] = {
			name = '太乙真人',
			skill = {52,38,171},
			skilllevel = {1,1,1},
			group = {[1] = 30,[3] = 14,[4] = 12,[5] = 14,[6] = 7,[7] = 8,[8] = 8,[9] = 7,[13] = 322},
			point = 1000000,
			sw = 150000,
			rid = 2050,
		},	
		
	},
	-- [4] = {
		-- [1] = {
			-- name = '哪吒',
			-- skill = {34,37,47},
			-- skilllevel = {1,1,1},
			-- group = {[1] = 32,[3] = 16,[4] = 14,[5] = 16,[6] = 11,[7] = 12,[8] = 12,[9] = 12,[13] = 322},
			-- point = 1500000,
			-- sw = 190000,
			-- rid = 2052,
		-- }, 
		-- [2] = { 
			-- name = '杨戬',
			-- skill = {34,38,46},
			-- skilllevel = {1,1,1},
			-- group = {[1] = 33,[3] = 16,[4] = 14,[5] = 17,[6] = 11,[7] = 12,[8] = 12,[9] = 12,[13] = 322},
			-- point = 3000000,
			-- sw = 260000,
			-- rid = 2058,	
		-- },
		-- [3] = { 
			-- name = '雷震子',
			-- skill = {52,39,36},
			-- skilllevel = {1,1,1},
			-- group = {[1] = 35,[3] = 15,[4] = 15,[5] = 15,[6] = 11,[7] = 11,[8] = 11,[9] = 11,[13] = 322},
			-- point = 1000000,
			-- sw = 130000,
			-- rid = 2055,	
		-- },		
	-- },
	[10] = { --特殊家将，需要激活
		[1] = { 
			name = '云霄仙子',
			color = 3,
			skill = {34,42,173},
			skilllevel = {1,1,1},
			group = {[1] = 23,[3] = 10,[4] = 8,[5] = 6,[6] = 3,[7] = 4,[8] = 3,[9] = 3,[13] = 322},
			point = 1000,
			rid = 2060,
			goodid = 200,
		},
		
		[2] = { 
			name = '碧霄仙子',
			color = 3,
			skill = {52,39,173},
			skilllevel = {1,1,1},
			group = {[1] = 25,[3] = 12,[4] = 10,[5] = 7,[6] = 4,[7] = 4,[8] = 3,[9] = 4,[13] = 322},
			point = 1000,
			rid = 2063,
			goodid = 201,
		},
		[3] = {
			name = '哪吒',
			color = 4,
			skill = {34,47,204},
			skilllevel = {1,1,1},
			group = {[1] = 32,[3] = 15,[4] = 12,[5] = 14,[6] = 8,[7] = 8,[8] = 8,[9] = 8,[13] = 322},
			point = 300000,
			rid = 2052,
			goodid = 210,
		}, 
		[4] = { 
			name = '瑶姬',
			color = 3,
			skill = {34,42,173},
			skilllevel = {1,1,1},
			group = {[1] = 23,[3] = 10,[4] = 8,[5] = 6,[6] = 3,[7] = 4,[8] = 3,[9] = 3,[13] = 322},
			point = 1000,
			rid = 2065,
			goodid = 203,
		},
		[5] = { 
			name = '雷震子',
			color = 4,
			skill = {52,40,39},
			skilllevel = {1,1,1},
			group = {[1] = 35,[3] = 15,[4] = 15,[5] = 15,[6] = 11,[7] = 11,[8] = 11,[9] = 11,[13] = 322},
			point = 1000000,
			rid = 2055,	
			goodid = 209,
		},		
	},
}

--随从基本配置
Hero_conf = {
	mxlv = 100, --武将最大等级(法力、培养、经验）
	mxnm = 4, --武将最大招募数
	mipl	= 15, --招募武将的最小等级
	good = {671,10}, --{法化所需道具,每个价值元宝数}
}